[{"pk": 1, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Badgerific!", "url": "/", "template_name": "", "sites": [1], "content": "<p style=\"text-align: center\"><img src=\"http://mjs-svc.com/badger/splash.png\"><br />\r\n<br />\r\nWelcome to Badger, badger!  Badge yo'self on up!</p>", "enable_comments": false}}, {"pk": 2, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "About!", "url": "/about/", "template_name": "", "sites": [1], "content": "<p><strong>Welcome to Badger!  Beta!</strong>  - If you run into any problems, feel free to <a href=\"mailto:mjs+badgerbeta@mjs-svc.com\">let us know!</a></p>\r\n\r\n<p>Badger! is a neat little tool that just makes a badge of contacts for you to put on your web site, blag, and so on.  In short, you create little badgelets for each of the accounts on each service you use with your user name or part of the URL, and these badgelets are added as icons to your badge.  All you have to do after that is copy-paste a little snippet of code wherever you want your badger to appear!  People visiting one of your places on the web can then get to one of your other places on the web with just a click.  If you have any questions, you can check out the <a href=\"/help/\">help page</a></p>\r\n\r\n<p>Badger! is a project by <a href=\"http://mjs-svc.com\">MJS Services</a> and was completed in two days after MJS woke up one morning with the idea fully formed in his head.  Weird, huh?  It all seems to have worked out, though!  It's provided as a free service*, but it isn't quite free to run, so if you're happy with it, you can always show it by <a href=\"/donate/\">donating</a></p>\r\n\r\n<p>:o)</p>\r\n\r\n<p>* All the stuff that makes Badger! work is provided under the GNU GPLv3<br />\r\n<a href=\"http://www.gnu.org/licenses/gpl.html\"><img src=\"http://media.drab-makyo.com/images/gplv3-88x31.png\" /></a></p>\r\n\r\n<p>If you're interested in running your own version of Badger! for your self for some reason, please <a href=\"http://mjs-svc.com/contact\">contact</a> MJS Services about it.</p>", "enable_comments": false}}, {"pk": 4, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Donate!", "url": "/donate/", "template_name": "", "sites": [1], "content": "<p>Help a badger out!  This site is offered as a free service because it's pretty minimal, but unfortunately, it does cost a little bit to maintain and run.  Toss us a buck or two to help us out with coffee, not that we need any more!</p>\r\n\r\n<form action=\"https://www.paypal.com/cgi-bin/webscr\" method=\"post\">\r\n<input type=\"hidden\" name=\"cmd\" value=\"_s-xclick\">\r\n<input type=\"hidden\" name=\"hosted_button_id\" value=\"GCEMA35EEJGL8\">\r\n<input type=\"image\" src=\"https://www.paypal.com/en_US/i/btn/btn_donateCC_LG.gif\" border=\"0\" name=\"submit\" alt=\"PayPal - The safer, easier way to pay online!\">\r\n<img alt=\"\" border=\"0\" src=\"https://www.paypal.com/en_US/i/scr/pixel.gif\" width=\"1\" height=\"1\">\r\n</form>\r\n", "enable_comments": false}}, {"pk": 3, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Help!", "url": "/help/", "template_name": "", "sites": [1], "content": "<p>Help!  Don't understand?  Here's a few steps to go through!</p>\r\n\r\n<ol>\r\n<li class=\"odd\"><strong>Join on up!</strong>  - If you haven't already, you can <a href=\"/accounts/create/\">join</a> in order to make your own badge.</li>\r\n<li class=\"even\"><strong>Pick out some services</strong> - Are you on facebook?  Youtube?  Livejournal?  All of these services and more can be added to your badge as badgelets!  Simply find the service and give us a little bit of an identifier!  For many sites, this will be your user name for that site (don't worry, we'll never ask for any passwords!), but some, such as Facebook are a little more involved and will require you to copy a portion of the URL in order for the badgelet to work for everyone.<br />\r\n<img src=\"http://mjs-svc.com/badger/step2.png\" style=\"border: 1px solid black; width: 400px\" /></li>\r\n<li class=\"odd\"><strong>Get your badge</strong> - When you go to the 'your badge' page, you're given a snippet of code you can put on whichever page you'd like (note that some sites don't allow posting of code - apologies!  Nothing we can do about that, unfortunately; though you can post a link to your badge page in the badge's stead!) simply by copy-pasting!<br />\r\n<img src=\"http://mjs-svc.com/badger/step3.png\" style=\"border: 1px solid black; width: 400px\" /></li>\r\n<li class=\"even\"><strong>Rinse, repeat, edit as needed!</strong> - You can add as many badgelets as you'd like for your presence around the web.  Note that there are a few services flagged as 'adult', which means that you can add them to your badge, but only to those who are logged into Badger themselves.  You may also edit or delete any of your badges from the 'your badge' page.  Editing looks just like adding - you can simply change the identifier you've given - and deleting is just a click away, after a confirmation!<br />\r\n<img src=\"http://mjs-svc.com/badger/step4.png\" style=\"border: 1px solid black; width: 400px\" /></li>\r\n</ol>", "enable_comments": false}}]
